# 01 Data Set

In [2]:
import pandas as pd

In [3]:
data = pd.read_table('http://bit.ly/chiporders')

In [4]:
data.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
# data.head()
# data.tail()
data.shape

(4622, 5)

In [6]:
col_names = ['ID', 'Age', 'Gender', 'Occupation', 'Revenue']

In [7]:
data2 = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=col_names)

In [8]:
data2

      ID  Age Gender     Occupation Revenue
0      1   24      M     technician   85711
1      2   53      F          other   94043
2      3   23      M         writer   32067
3      4   24      M     technician   43537
4      5   33      F          other   15213
..   ...  ...    ...            ...     ...
938  939   26      F        student   33319
939  940   32      M  administrator   02215
940  941   20      M        student   97229
941  942   48      F      librarian   78209
942  943   22      M        student   77841

[943 rows x 5 columns]

# 02 Series and Data Frame

In [9]:
type(data2['Age'])

pandas.core.series.Series

In [10]:
data2.Age

0      24
1      53
2      23
3      24
4      33
       ..
938    26
939    32
940    20
941    48
942    22
Name: Age, Length: 943, dtype: int64

In [11]:
data2.Age

0      24
1      53
2      23
3      24
4      33
       ..
938    26
939    32
940    20
941    48
942    22
Name: Age, Length: 943, dtype: int64

# 03 Operations in Data Set

In [12]:
'a' + 'b'

'ab'

In [13]:
8 + 8

16

In [14]:
'a' + 7

TypeError: can only concatenate str (not "int") to str

In [18]:
data2.Occupation + data2.Gender

0         technicianM
1              otherF
2             writerM
3         technicianM
4              otherF
            ...
938          studentF
939    administratorM
940          studentM
941        librarianF
942          studentM
Length: 943, dtype: object

In [21]:
data2.new = data2.Occupation + data2.Gender

<ipython-input-21-b3d668d7d567>:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  data2.new = data2.Occupation + data2.Gender

In [22]:
data2.head(5)

   ID  Age Gender  Occupation Revenue
0   1   24      M  technician   85711
1   2   53      F       other   94043
2   3   23      M      writer   32067
3   4   24      M  technician   43537
4   5   33      F       other   15213

In [23]:
data2['new'] = data2.Occupation + ' ' + data2.Gender

In [26]:
data2.head()

   ID  Age Gender  Occupation Revenue           new
0   1   24      M  technician   85711  technician M
1   2   53      F       other   94043       other F
2   3   23      M      writer   32067      writer M
3   4   24      M  technician   43537  technician M
4   5   33      F       other   15213       other F